Tekla Open API Reference for Tekla Structures 2025
Plugin.GetDoubleAttribute Method
 Gets the value of the specified double attribute of the plug-in.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double GetDoubleAttribute(
	string FieldName
)
Public Function GetDoubleAttribute (
	FieldName As String
) As Double
Parameters
FieldName
Type: System.String
The name of the attribute to get.
Return Value
Type: Double
The value of the attribute, or 0 if the plug-in does not have such an attribute.
Exceptions
Exception | Condition
CannotGetAttributeForPluginException |  Thrown when the getting of the attribute failed for an unknown reason (might indicate an invalid plug-in name).
CannotGetAttributeForPluginDueToIncorrectTypeException |  Thrown when getting a value with an invalid type for the specified field.
CannotGetAttributeForPluginDueToInexistantFieldException |  Thrown when getting the value of an inexistent field.
See Also
Reference
Plugin Class
Tekla.Structures.Drawing Namespace